** DONE Q3. Consider a group of 30 people who wish to establish pair-wise secure communications using symmetric-key cryptography. How many keys need to be exchanged in total.
In a set size n there are n(n − 1)/2 pairs of elements:
#+header: :exports results
#+header: :var n=30
#+BEGIN_SRC maxima :results output
result: (n*(n-1))/2;
print(result);
#+END_SRC

#+RESULTS:
: 435

